Repository: xray700r/rufus
Catalog: res/loc/po/al-AL.po
Languages: sq_al

source: Method that will be used to make the drive bootable
sq_al: Metoda qe do te perdoret per te bere drive te boot

source: Click to select or download an image...
sq_al: Kliko per te zgjedhur ose shkarkuar imazhin...

source: Check this box to allow the display of international labels and set a device icon (creates an autorun.inf)
sq_al: Abilita questa opzione per permettere la visualizzazione delle etichette internazionali e impostare una icona dispositivo (creerà un file autorun.inf)

source: Install an MBR that allows boot selection and can masquerade the BIOS USB drive ID
sq_al: Instalo nje MBR qe lejon zgjedhjen e boot se njesise USB me maskim ID nga BIOS

source: Try to masquerade first bootable USB drive (usually 0x80) as a different disk. This should only be necessary if you install Windows XP and have more than one disk.
sq_al: Provo te maskosh njesine boot USB (normalisht 0x80) si nje disk tjeter. Kjo mund te jete e nevojshme vetem ne rastin e instalimit te Windows XP dhe ke me shume se nje disk.

source: Create an extra hidden partition and try to align partitions boundaries. This can improve boot detection for older BIOSes.
sq_al: Krijo nje particion shtese te fshehur dhe rivendos kufijte e particioneve. Kjo ndihmon ne gjendjen e boot me BIOS te vjeter.

source: Enable the listing of USB Hard Drive enclosures. USE AT YOUR OWN RISKS!!!
sq_al: Aktivizo gjetjen e diskeve USB. PERDORE ME KUJDES!!!

source: Start the formatting operation. This will DESTROY any data on the target!
sq_al: Nis veprimin e formatimit. Ky veprim do te SHKATERROJE cdo te dhene ne njesi!

source: Invalid download signature
sq_al: Firma e shkarkimit jo e vlefshme

source: Click to select...
sq_al: Kliko per te zgjedhur...

source: Rufus - The Reliable USB Formatting Utility
sq_al: Rufus - Mjet i besueshem per formatim te USB

source: Version %d.%d (Build %d)
sq_al: Versioni %d.%d (build %d)

source: English translation: Pete Batard <mailto:pete@akeo.ie>
sq_al: Perkthimi Shqip i kryer nga xray700r

source: Report bugs or request enhancements at:
sq_al: Lajmero per probleme ose kerko funksione te reja nga:

source: Additional Copyrights:
sq_al: Te drejta shtese:

source: Update Policy:
sq_al: Policy e azhornimit:

source: If you choose to allow this program to check for application updates, you agree that the following information may be collected on our server(s):
sq_al: Nese pranon te lejosh kete program te kontrolloje vetvetiu azhornimet, pranon qe informacionet ne vijim te ruhen ne serverat tone:

source: Your operating system's architecture and version
sq_al: Arkitektura e sistemit tend operativ dhe versioni

source: The version of the application you use
sq_al: Versioni i aplikacionit qe po perdor

source: Your IP address
sq_al: Adresa juaj e IP

source: For the purpose of generating private usage statistics, we may keep the information collected, \b for at most a year\b0 . However, we will not willingly disclose any of this individual data to third parties.
sq_al: Mund te mbajme informacionet vetem per arsye statitstike perdorimi private , \b per nje vit me e shumta\b0 . Gjithsesi te grantojme se NUK do te dergojme asnje nga keto te dhena nje pale te trete.

source: Update Process:
sq_al: Procesi Azhornimit:

source: Rufus does not install or run background services, therefore update checks are performed only when the main application is running.\line Internet access is of course required when checking for updates.
sq_al: Rufus nuk instalon ose ekzekuton sherbime ne prapaskene. Kontrolli i azhornimeve do te kryhet vetem kur palikacioni esht ene ekzekutim.\line Aksesi ne internet kerkohet vetem kur kerkohen azhornime.

source: Invalid image for selected boot option
sq_al: Imazh jo i vlefshem per kete opsion te boot te zgjedhur

source: The current image doesn't match the boot option selected. Please use a different image or choose a different boot option.
sq_al: Imazhi i zgjedhur nuk i perket opsionit te boot te zgjedhur. Perdor imazh tjeter ose zgjidh nje opsion boot tjeter.

source: This ISO image is not compatible with the selected filesystem
sq_al: Ky imazh nuk eshte i pershtatshem me file-system te zgjedhur.

source: Incompatible drive detected
sq_al: Njesi drive jo e pershtateshme

source: Write pass
sq_al: Faza shkrimit

source: Read pass
sq_al: Faza leximit

source: Downloaded %s
sq_al: Shkarkuar %s

source: Could not download %s
sq_al: E pamundur te shkarkohet %s

source: Using embedded version of %s file(s)
sq_al: Perdor versionin e gjendur te file %s

source: IMPORTANT: THIS DRIVE USES A NONSTANDARD SECTOR SIZE! Conventional drives use a 512-byte sector size but this drive uses a %d-byte one. In many cases, this means that you will NOT be able to boot from this drive. Rufus can try to create a bootable drive, but there is NO WARRANTY that it will work.
sq_al: KUJDES: KJO NJESI PERDOR NEJ PERMASE SEKTORI JO STANDARTE! Njesite standarte jane 512 byte por kjo njesi perdor permasa %d byte. Ne shume raste do te thote se NUK mudn te besh boot nga kjo njesi. Rufus do te provoje te krijoje nje boot po NUK GARANTON funksionimin e tij.

source: Nonstandard sector size detected
sq_al: U gjet permase sektori jo standarte

source: 'Windows To Go' can only be installed on a GPT partitioned drive if it has the FIXED attribute set. The current drive was not detected as FIXED.
sq_al: 'Windows To Go' mund te instalohet vetem mbi nje njesi te particionuar me GPT nese ka atributin FIXED te percaktuar. Njesia aktuale nuk eshte FIXED.

source: Cancelling - Please wait...
sq_al: Ndalim...

source: Scanning image...
sq_al: Analiza e imazhit...

source: Failed to scan image
sq_al: Analiza e imazhit nuk u krye dot

source: Obsolete %s detected
sq_al: U gjend %s e vjeteruar

source: Using image: %s
sq_al: Perdorim imazhi: %s

source: Missing %s file
sq_al: File %s mungon

source: New Volume
sq_al: Vellim i ri

source: %d device found
sq_al: U gjend %d njesi

source: %d devices found
sq_al: U gjeten %d njesi

source: READY
sq_al: GATI

source: Cancelled
sq_al: Ndaluar

source: Failed
sq_al: VEPRIMI U BLLOKUA

source: Launching new application...
sq_al: Ekzekuto aplikacion te ri...

source: Failed to launch new application
sq_al: Ekzekutimi i aplikacionit te ri nuk u krye dot

source: Opened %s
sq_al: Hapur %s

source: Saved %s
sq_al: Ruajtur %s

source: Formatting: %0.1f%% completed
sq_al: Formatimi: %0.1f%% i kompletuar

source: Creating file system: Task %d/%d completed
sq_al: Krijimi file-system: aktiviteti %d/%d i kompletuar

source: NTFS Fixup: %d%% completed
sq_al: Korrigjimi NTFS: %d%% i kompletuar

source: Formatting (%s) - estimated duration %d:%02d...
sq_al: Formatimit (%s) - kohezgjatja e parashikuar %d:%02d...

source: Setting Label (This may take a while)...
sq_al: Vendosje etikete (mund te zgjasi pak kohe)...

source: Formatting (%s)...
sq_al: Formatimi (%s)...

source: NTFS Fixup (Checkdisk)...
sq_al: Korrigjimi NTFS (kontrolli i diskut)...

source: Clearing MBR/PBR/GPT structures...
sq_al: Pastrimi i struktures MBR/PBR/GPT

source: Requesting disk access...
sq_al: Kerkese per akses ne disk...

source: Analyzing existing boot records...
sq_al: Analizimi i te dhenave te boot...

source: Closing existing volume...
sq_al: Mbyllja e vellimit ekzistues...

source: Writing master boot record...
sq_al: Shkrimi i Master Boot Record...

source: Writing partition boot record...
sq_al: Shkrimi i Partition Boot Record...

source: Copying DOS files...
sq_al: Kopjimi fileve DOS...

source: Copying ISO files...
sq_al: Kopjimi i fileve te imazheve ISO...

source: Win7 EFI boot setup (This may take a while)...
sq_al: Te dhenat e boot EFI Windows 7 (mund te zgjasi pak kohe)...

source: Finalizing, please wait...
sq_al: Mbyllja veprimit...

source: Installing Syslinux %s...
sq_al: Instalimi Syslinux %s...

source: Bad Blocks: %s %d/%d - %0.2f%% (%d/%d/%d errors)
sq_al: Blloqe te demtuara: %s %d/%d - %0.2f%% (%d/%d/%d gabime)

source: Bad Blocks: Testing with random pattern
sq_al: Blloqe te demtuara: test me pattern te rastesishem

source: Bad Blocks: Testing with pattern 0x%02X
sq_al: Blloqe te demtuara: teste me pattern 0x%02X

source: Partitioning (%s)...
sq_al: Particionimi (%s)...

source: Deleting partitions...
sq_al: Fshirje e particioneve...

source: The signature for the downloaded update can not be validated. This could mean that your system is improperly configured for signature validation or indicate a malicious download. The download will be deleted. Please check the log for more details.
sq_al: Firma per azhornimin e shkarkuar nuk mund te verifikohet. Kjo do te thote qe sistemi nuk eshte i konfiguruar ne menyre te rregullt per verifikimin e firmes ose shkarkimi nuk eshte i sakte. File i shkarkuar do te fhishet. Per me shume detaje lexoni regjistrin e ngjarjeve.

source: Downloading: %0.1f%%
sq_al: Shkarkimi: %0.1f%%

source: Failed to download file.
sq_al: E pamundur te shkarkohet file.

source: Checking for Rufus updates...
sq_al: Verifikim nese ka azhornime per Rufus...

source: Updates: Unable to connect to the internet
sq_al: Azhornimi: nuk mund te lidhemi me Internet

source: Updates: Unable to access version data
sq_al: Azhornimi: nuk mund te gjejme informacion mbi versionin

source: A new version of Rufus is available!
sq_al: Nje version i ri i Rufus eshte e gateshme!

source: No new version of Rufus was found
sq_al: Nuk u gjeten versione me te reja te Rufus

source: Application registry keys successfully deleted
sq_al: Celesat e regjistrit te aplikacionit u eliminuan me sukses

source: Failed to delete application registry keys
sq_al: Nuk mund te fshihen celesat e regjistrit te aplikacionit

source: %s enabled
sq_al: Aktivizuar %s

source: %s disabled
sq_al: C'aktivizuar %s

source: Size checks
sq_al: Kontrolli permasave

source: Hard disk detection
sq_al: Kerkimi i njesive memorizuese

source: Force large FAT32 formatting
sq_al: Detyro formatim FAT32 te gjere

source: NoDriveTypeAutorun will be deleted on exit
sq_al: NoDriveTypeAutorun do te fshihet ne dalje

source: Fake drive detection
sq_al: Kerkim i njesive false

source: Joliet support
sq_al: Suporti Joliet

source: Rock Ridge support
sq_al: Suprti Rock Ridge

source: Force update
sq_al: Detyro azhornimin

source: NTFS compression
sq_al: Kompresim NTFS

source: Writing image: %0.1f%% completed
sq_al: Shkrimi i imazhit: %0.1f%% kompletuar

source: ISO Support
sq_al: Suporti ISO

source: Use PROPER size units
sq_al: Perdor dimensionet e SAKTA te permasave

source: Deleting directory '%s'
sq_al: Fshirje e direktorise '%s'

source: VMWare disk detection
sq_al: Kerkim i njesive VMWare

source: Dual UEFI/BIOS mode
sq_al: Funksion i dyfishte UEFI/BIOS

source: Applying Windows image: %0.1f%% completed
sq_al: Vendosja e imazhit Windows: %0.1f%% kompletuar

source: Applying Windows image...
sq_al: Vendosja e imazhit Windows...

source: Preserve timestamps
sq_al: Ruaj daten/oren

source: USB debug
sq_al: Kerko difekte USB

source: Computing image checksums: %0.1f%% completed
sq_al: Llogaritja e checksum te imazhit: %0.1f%% kompletuar

source: Compute the MD5, SHA1 and SHA256 checksums for the selected image
sq_al: Llogaritja e checksum MD5, SHA1 dhe SHA256 per imazhin e zgjedhur

source: Change the application language
sq_al: Ndrysho gjuhen e nderfaqjes

source: ISOHybrid image detected
sq_al: U gjend nje imazh ISO hibrid

source: The image you have selected is an 'ISOHybrid' image. This means it can be written either in %s (file copy) mode or %s (disk image) mode. Rufus recommends using %s mode, so that you always have full access to the drive after writing it. However, if you encounter issues during boot, you can try writing this image again in %s mode. Please select the mode that you want to use to write this image:
sq_al: Imazhi ISO i zgjedhur eshte hibrid. Mund te regjistrohet ne menyre '%s' (kopje e file) ose si '%s' (imazh disku). Rufus sugjeron perdorimin e '%s', per te pasur akses te plote mbi njesine pas shkrimit. Nese shfaqen probleme ne boot, mund te provosh te shkruash kete imazh ne menyre %s. Zgjidhni menyren qe do te perdoresh per te shkruar imazhin:

source: Write in %s mode (Recommended)
sq_al: Shkruaj si %s (keshillohet)

source: Write in %s mode
sq_al: Shkruaj ne menyre %s

source: Checking for conflicting processes...
sq_al: Kontrolli i proceseve kundershtuese...

source: Non bootable
sq_al: Jo per boot

source: Disk or ISO image
sq_al: Imazh disku ose ISO

source: %s (Please select)
sq_al: %s (Zgjidhni)

source: Exclusive USB drive locking
sq_al: Bllokim i vecante per USB

source: Invalid signature
sq_al: Firma jo e vlefshme

source: The downloaded executable is missing a digital signature.
sq_al: File i ekzekutueshem i shkarkuar nuk ka firme elektronike.

source: The downloaded executable is signed by '%s'. This is not a signature we recognize and could indicate some form of malicious activity... Are you sure you want to run this file?
sq_al: File i ekzekutueshem i eshte firmosur nga '%s'. Kjo firme nuk eshte e njohur dhe mund te jete shenje e nje aktiviteti keqedashes. Je i sigurte qe do te ekzekutosh kete file?

source: Zeroing drive: %0.1f%% completed
sq_al: Zerimi i drive: %0.1f%% kompletuar

source: Detection of non-USB removable drives
sq_al: Kerkimi i njesive te levizeshme jo-USB

source: Missing elevated privileges
sq_al: Privilegjet ekzekutuese duhen me te larta

source: This application can only run with elevated privileges
sq_al: Ky aplikacion mund te ekzekutohet vetem me privilegje me te larta

source: File Indexing
sq_al: Indeksimi i file

source: Version selection
sq_al: Zgjidhni versionin

source: Please select the version of Windows you want to install:
sq_al: Zgjidhni versionin e Windows qe do te instalohet:

source: Unsupported Windows version
sq_al: Ky versione i Windows nuk perdoret dot

source: This version of Windows is no longer supported by Rufus.
sq_al: Ky version i Windows nuk perdoret me nga Rufus.

source: Warning: Unofficial version
sq_al: Kujdes: version jo zyrtar

source: This version of Rufus was not produced by its official developer(s). Are you sure you want to run it?
sq_al: Ky version i Rufus nuk eshte zhvilluar nga programuesit zyrtar. Je i sigurte qe do ta ekzekutosh?

source: Truncated ISO detected
sq_al: U gjend nje file ISO i pjesshem

source: The ISO file you have selected does not match its declared size: %s of data is missing! If you obtained this file from the Internet, you should try to download a new copy and verify that the MD5 or SHA checksums match the official ones. Note that you can compute the MD5 or SHA in Rufus by clicking the (✓) button.
sq_al: Ky file ISO i zgjedhur nuk eshte sa dimensioni i deklaruar: %s e te dhenave mungojne! Nese e ke shkarkuar nga Internet, provo perseri dhe kontrollo qe checksum MD5 ose SHA te jene identike me ato te deklaruara. Vej re se mund te llogaritesh checksum ne Rufus duke klikuar butonin (✓).

source: Timestamp validation error
sq_al: Gabim ne rregjistrimin e dates/ores

source: Rufus could not validate that the timestamp of the downloaded update is more recent than the one for the current executable. In order to prevent potential attack scenarios, the update process has been aborted and the download will be deleted. Please check the log for more details.
sq_al: Rufus nuk mund te verifikoje qe data/ora e paketes se azhornimit eshte me e re se ajo e programit ekzistues. Per te parandaluar mundesine e perdorimit te nje malware, procesi i azhornimit u nderpre dhe shkarkimi do te fshihet. Per me shume detaje lexo regjistrin e ngjarjeve.

source: Show application settings
sq_al: Shfaq konfigurimet e aplikacionit

source: Show information about this application
sq_al: Shfaq informacionet mbi kete aplikacion

source: Show the log
sq_al: Shfaq regjistrin e ngjarjeve

source: Create a disk image of the selected device
sq_al: Krijo nje imazh te diskut per njesine e perzgjedhur

source: Use this option to indicate whether you want to use this device to install Windows on another disk, or if you want to run Windows directly from this drive (Windows To Go).
sq_al: Perdor kete alternative per te saktesuar nese do perdoresh kete njesi per te instaluar Windows ne nje njesi tjeter, ose per te nisur Windows direkt nga kjo njesi (Windows To Go).

source: Fast-zeroing drive: %0.1f%% completed
sq_al: Zerimi i shpejte i njesise: %0.1f%% kompletuar
