Repository: xray700r/rufus
Catalog: res/loc/po/al-AL.po
Languages: sq_al

source: Drive Properties
sq_al: Vetite e Drive

source: Device
sq_al: Aparati/Njesia

source: Boot selection
sq_al: Zgjidhja e Boot

source: Select
sq_al: Zgjidh

source: Image Option
sq_al: Zgjedhja e imazhit

source: Partition scheme
sq_al: Skema e particioneve

source: Target system
sq_al: Sistemi destinacion

source: List USB Hard Drives
sq_al: Lista e njesive USB

source: Add fixes for old BIOSes (extra partition, align, etc.)
sq_al: Shto korrigjime per BIOS te vjetera (particione shtese, renditja, etj)

source: Use Rufus MBR with BIOS ID
sq_al: Perdor MBR te Rufus me ID BIOS

source: Format Options
sq_al: Opsione formatimi

source: File system
sq_al: Sistemi fileve

source: Cluster size
sq_al: Permasat e cluster

source: Volume label
sq_al: Emri i vellimit

source: Quick format
sq_al: Formatimi i shpejte

source: Check device for bad blocks
sq_al: Kontrollo njesine per blloqe te demtuara

source: Create extended label and icon files
sq_al: Krijo emra te gjate dhe file ikonash

source: Status
sq_al: Gjendja

source: Close
sq_al: Mbyll

source: Start
sq_al: Nis

source: About Rufus
sq_al: Mbi Rufusin

source: License
sq_al: Leja

source: Rufus License
sq_al: Leja per Rufus

source: More information
sq_al: Me shume informacion

source: Yes
sq_al: Po

source: No
sq_al: Jo

source: Log
sq_al: Regjistri

source: Clear
sq_al: Pastro

source: Save
sq_al: Shpeto

source: Update policy and settings
sq_al: Parametrat dhe kushtet e azhornimit

source: Settings
sq_al: Parametrat

source: Check for updates
sq_al: Kontrolli i azhornimeve

source: Include beta versions
sq_al: Perfshi versionet beta

source: Check Now
sq_al: Kontrollo tani

source: Check For Updates - Rufus
sq_al: Rufus - Kontrolli i azhornimeve

source: A newer version is available. Please download the latest version!
sq_al: Nje version i ri eshte i gatshem. Shkarko versionin e azhornuar!

source: Click here to go to the website
sq_al: Kliko ketu per te shkuar ne faqen web

source: Release Notes
sq_al: Informacioniet e versioneve

source: Download
sq_al: Shkarko

source: Other instance detected
sq_al: U gjend nje tjeter ekzekutim i Rufus

source: Another Rufus application is running. Please close the first application before running another one.
sq_al: Po ekzekutohet nje tjeter aplikacion Rufus. Mbyll aplikacionin para se te nisesh nje te dyte.

source: WARNING: ALL DATA ON DEVICE '%s' WILL BE DESTROYED. To continue with this operation, click OK. To quit click CANCEL.
sq_al: KUJDES: TE GJITHA TE DHENAT MBI NJESINE '%s' DO TE FSHIHEN. Per te vazhduar zgjidh 'OK'. Per te ndaluar zgjidh 'NDALO'.

source: Rufus update policy
sq_al: Policy e azhornimeve te Rufus

source: Do you want to allow Rufus to check for application updates online?
sq_al: Do ta lejosh Rufusin te kontrolloje azhornimet online?

source: Cancel
sq_al: Ndalo

source: Bad blocks found
sq_al: U gjend nje bllok me difekte

source: Check completed: %d bad block(s) found %d read error(s) %d write error(s) %d corruption error(s)
sq_al: Kontrolli u kompletua: u gjenden %d blloqe me difekte %d gabime ne lexim %d gabime ne shkrim %d te korruptuara

source: %s A more detailed report can be found in: %s
sq_al: %s Nje raport me i detajuar mund te gjendet ne: %s

source: Disabled
sq_al: E c'aktivizuar

source: Daily
sq_al: E perditeshme

source: Weekly
sq_al: Javore

source: Monthly
sq_al: Mujore

source: Custom
sq_al: E personalizuar

source: Your version: %d.%d (Build %d)
sq_al: Versioni instaluar: %d.%d (Build %d)

source: Latest version: %d.%d (Build %d)
sq_al: Versioni azhornuar: %d.%d (Build %d)

source: bytes
sq_al: byte

source: kilobytes
sq_al: kilobyte

source: megabytes
sq_al: megabyte

source: Default
sq_al: E parapercaktuar

source: %s (Default)
sq_al: %s (parapercaktuar)

source: BIOS (or UEFI-CSM)
sq_al: BIOS (ose UEFI CSM)

source: UEFI (non CSM)
sq_al: UEFI (jo CSM)

source: BIOS or UEFI
sq_al: BIOS ose UEFI

source: %d pass
sq_al: %d kalimi

source: %d passes %s
sq_al: %d kalime %s

source: ISO Image
sq_al: Imazh ISO

source: Application
sq_al: Aplikacioni

source: Abort
sq_al: Anullo

source: Launch
sq_al: Zbato

source: Operation cancelled by the user
sq_al: Veprimi u anullua nga perdoruesi

source: Error
sq_al: Gabim

source: Error: %s
sq_al: Gabim: %s

source: File download
sq_al: Shkarkim i file

source: USB Storage Device (Generic)
sq_al: Njesi memorie USB (e pergjithshme)

source: %s (Disk %d) [%s]
sq_al: %s (disku %d) [%s]

source: Multiple Partitions
sq_al: Particione te shumefishta

source: Rufus - Flushing buffers
sq_al: Rufus - Zbrazje e buffer

source: Rufus - Cancellation
sq_al: Rufus - Anullim

source: Success.
sq_al: Sukses.

source: Undetermined error while formatting.
sq_al: Gabim i panjohur gjate formatimit.

source: Cannot use the selected file system for this media.
sq_al: E pamundur te perdorer filesystem i zgjedhur.

source: Access to the device is denied.
sq_al: Njesia nuk mund te aksesohet.

source: Media is write protected.
sq_al: Njesia ka mbrojtje ne shkrim.

source: The device is in use by another process. Please close any other process that may be accessing the device.
sq_al: Njesia po perdoret nga nje proces tjeter. Mbyllni proceset e tjera qe po perdorin njesine.

source: Quick format is not available for this device.
sq_al: Formatimi i shpejte nuk eshte i mundur per kete njesi.

source: The volume label is invalid.
sq_al: Etiketa e vellimit jo e vlefshme.

source: The device handle is invalid.
sq_al: Perdoruesi i njesise nuk eshte i vlefshem

source: The selected cluster size is not valid for this device.
sq_al: Permasa e cluster per kete njesi eshte e pavlefshme.

source: The volume size is invalid.
sq_al: Dimensioni vellimit i pavlefshem.

source: Please insert a removable media in drive.
sq_al: Ju lutem vendosni nje njesi te levizeshme.

source: An unsupported command was received.
sq_al: Po ekzekutoni nje komande te panjohur.

source: Memory allocation error.
sq_al: Gabim ne vendosjen e memories.

source: Read error.
sq_al: Gabim ne lexim.

source: Write error.
sq_al: Gabim ne shkrim.

source: Installation failure
sq_al: Instalimi jo i suksesshem

source: Could not open media. It may be in use by another process. Please re-plug the media and try again.
sq_al: E pamundur hapja e njesise. Mund te jete ne perdorim nga nje proces tjeter. Rilidhni njesine dhe provoni perseri.

source: Could not partition drive.
sq_al: Nuk mund te particionohej drive.

source: Could not copy files to target drive.
sq_al: Nuk mund te kopjohen filet ne drive.

source: Cancelled by user.
sq_al: U anullua nga perdoruesi.

source: Unable to start thread.
sq_al: Nuk niset dot veprimi.

source: Bad blocks check didn't complete.
sq_al: Kontrolli i blloqeve te gabuara nuk u kompletua.

source: ISO image scan failure.
sq_al: Analiza e imazhit ISO nuk mund te kryhet.

source: ISO image extraction failure.
sq_al: Ekstraktimi i imazhit ISO nuk mund te kryhet.

source: Unable to remount volume.
sq_al: E pamundur te rilidhet njesia.

source: Unable to patch/setup files for boot.
sq_al: I pamundur korrigjimi/vendosja e fileve per boot.

source: Unable to assign a drive letter.
sq_al: E pamundur ti jepet nje germe njesise.

source: Can't mount GUID volume.
sq_al: I pamundur montimi i vollimit me GUID.

source: The device is not ready.
sq_al: Njesia nuk eshte gati.

source: Rufus detected that Windows is still flushing its internal buffers onto the USB device. Depending on the speed of your USB device, this operation may take a long time to complete, especially for large files. We recommend that you let Windows finish, to avoid corruption. But if you grow tired of waiting, you can just unplug the device...
sq_al: Rufus ka kuptuar qe Windows eshte duke shkarkuar bufferat e brendeshm lidhur me njesine USB. Ne varesi te shpejtesise se njesise USB, ky veprim do kohe te perfundoje, sidomos per file te medha. Ju sugjerojme te prisni qe Windows te perfundoje veprimin per te mos patur korruptim te dhenash. Nese nuk doni te prisni hiqni fisikisht njesine ...

source: Unsupported image
sq_al: Formati i imazhit jo i njohur

source: This image is either non-bootable, or it uses a boot or compression method that is not supported by Rufus...
sq_al: Ky imazh nuk mund te behet boot, ose perdor metoda boot dhe kompresimi te panjohura nga Rufus...

source: Replace %s?
sq_al: Zevendeso %s?

source: This ISO image seems to use an obsolete version of '%s'. Boot menus may not display properly because of this. A newer version can be downloaded by Rufus to fix this issue: - Choose 'Yes' to connect to the internet and download the file - Choose 'No' to leave the existing ISO file unmodified If you don't know what to do, you should select 'Yes'. Note: The new file will be downloaded in the current directory and once a '%s' exists there, it will be reused automatically.
sq_al: Ky imazh duket se perdor nje version te tejkaluar te '%s'. Per kete arsye boot nuk do te shfaqet ne menyre te sakte. Nje version i ri mund te shkarkohet nga Rufus per te korrigjuar problemin: - Zgjidh 'Po' per lidhje me internet dhe shkarkim te file - Zgjidh 'Jo' per te mos ndryshuar imazhin ISO Ne rast dyshimi sugjerohet 'Po'. Shenim: file i ri do te shkarkohet en kete direktori dhe pas shkarkimit '%s', do te perdoret vetvetiu.

source: Downloading %s
sq_al: Shkarko %s

source: No image selected
sq_al: Nuk eshte zgjedhur asnje imazh

source: for %s NAND
sq_al: per NAND %s

source: Image is too big
sq_al: Imazhi eshte shume i madh

source: The image is too big for the selected target.
sq_al: Ky imazh eshte shume i madh per njesine ku do te hidhet.

source: Unsupported ISO
sq_al: Formati ISO nuk njihet

source: When using UEFI Target Type, only EFI bootable ISO images are supported. Please select an EFI bootable ISO or set the Target Type to BIOS.
sq_al: Kur perdor nje destinacion te tipit UEFI, mund te njihen vetem ISO me format EFI. Zgjidh nje imazh EFI ose vendos nje destinacion BIOS.

source: Unsupported filesystem
sq_al: Filesystem jo i njohur

source: IMPORTANT: THIS DRIVE CONTAINS MULTIPLE PARTITIONS!! This may include partitions/volumes that aren't listed or even visible from Windows. Should you wish to proceed, you are responsible for any data loss on these partitions.
sq_al: KUJDES: KJO NJESI MBART SHUME PARTICIONE! Kjo mund perfshije particione ose vellime qe nuk jane te dukshme dhe pse njihen nga Windows. Nese do te vazhdosh ke pergjegjesi per cdo humbje te dhenash ne keto particione.

source: Multiple partitions detected
sq_al: U gjeten shume particione

source: DD Image
sq_al: Imazh DD

source: The file system currently selected can not be used with this type of ISO. Please select a different file system or use a different ISO.
sq_al: Ky file-system i zgjedhur aktualish nuk mund te perdoret me kete tip imazhi ISO. Zgjidh nje tjeter format ose perdor nje tjeter file ISO.

source: '%s' can only be applied if the file system is NTFS.
sq_al: '%s' mund te perdoret vetem nese file-system eshte NTFS.

source: IMPORTANT: You are trying to install 'Windows To Go', but your target drive doesn't have the 'FIXED' attribute. Because of this Windows will most likely freeze during boot, as Microsoft hasn't designed it to work with drives that instead have the 'REMOVABLE' attribute. Do you still want to proceed? Note: The 'FIXED/REMOVABLE' attribute is a hardware property that can only be changed using custom tools from the drive manufacturer. However those tools are ALMOST NEVER provided to the public...
sq_al: KUJDES: po instalon 'Windows To Go', por njesia nuk ka nje atribut te tipit 'FIXED'. Windows do te bllokohet gjate boot pasi nuk eshte i projektuar per njesi me atribut 'REMOVABLE'. Do te vazhdos? Shenim: atributi 'FIXED/REMOVABLE' eshte nje aftesi hardware dhe mund te ndryshohet me mjete ne perdorim nga prodhuesi i njesise. Keto mjete nuk i jepen ne perdorim perdorueseve ...

source: Filesystem limitation
sq_al: Limiti i file-system

source: This ISO image contains a file larger than 4 GB, which is more than the maximum size allowed for a FAT or FAT32 file system.
sq_al: Ky imazh ISO permban file me te medha se 4GB, ky eshte limiti per file-system FAT ose FAT32.

source: Missing WIM support
sq_al: Mbeshtetja WIM nuk gjendet

source: Your platform cannot extract files from WIM archives. WIM extraction is required to create EFI bootable Windows 7 and Windows Vista USB drives. You can fix that by installing a recent version of 7-Zip. Do you want to visit the 7-zip download page?
sq_al: Sistemi juaj nuk mund te ekstraktoje file nga arkivat WIM. Ekstraktimi eshte i domosdoshem per te krijuar njesi USB me boot per EFI te Windows 7 dhe Vista. Mund te korrigjohet kjo mangesi duke instaluar nje version te fundit te 7-Zip. Doni te shkoni ne faqen e shkarkimit te 7-zip?

source: Download %s?
sq_al: Do te shkarkosh %s?

source: %s or later requires a '%s' file to be installed. Because this file is more than 100 KB in size, and always present on %s ISO images, it is not embedded in Rufus. Rufus can download the missing file for you: - Select 'Yes' to connect to the internet and download the file - Select 'No' if you want to manually copy this file on the drive later Note: The file will be downloaded in the current directory and once a '%s' exists there, it will be reused automatically.
sq_al: %s ose me te voneshme kerkon shkarkimin e nje file '%s'. Duke qene se ky file eshte me i madh se 100 KB, dhe gjendet perhere ne imazhin ISO te %s, ky file nuk perfshihet ne Rufus. Rufus mund te shkarkoje file qe mungon per ty: - Zgjidh 'Po' qe te lidhesh ne internet dhe te shkarkosh file - Zgjidh 'Jo' nese do ta kopjosh kete file me vone ne njesi Shenim: file do te shkarkohet ne direktorine aktuale dhe pasi '%s' eshte shkarkuar, do te perdoret vetvetiu.

source: Cancelling may leave the device in an UNUSABLE state. If you are sure you want to cancel, click YES. Otherwise, click NO.
sq_al: Ndalimi i procesit mudn ta leje njesine ne GJENDJE TE PAPERDORESHME. Je i sigurte qe do te ndalosh veprimin? Zgjidh PO. Ndryshe, zgjidh JO.

source: Please select folder
sq_al: Zgjidh direktorine

source: All files
sq_al: Te gjitha filet

source: Rufus log
sq_al: Regjistri i ngjarjeve te Rufus

source: 0x%02X (Disk %d)
sq_al: 0x%02X (disku %d)

source: MS-DOS cannot boot from a drive using a 64 kilobytes Cluster size. Please change the Cluster size or use FreeDOS.
sq_al: Nuk mund te niset MS-DOS nga nje njesi qe perdor nje dimension cluster prej 64 kilobyte. Ndrysho permasat e cluster ose perdor FreeDOS.

source: Incompatible Cluster size
sq_al: Permasat e cluster jo te pershtateshme

source: Formatting a large UDF volumes can take a lot of time. At USB 2.0 speeds, the estimated formatting duration is %d:%02d, during which the progress bar will appear frozen. Please be patient!
sq_al: Formatimi i nje vellimi UDF me permasa te medha mudn te kerkoje shume kohe. Ne USB 2.0, koha e parashikuar do te jete %d:%02d, gjate kesaj kohe gjendja nuk do te azhornohet. Prit perfundimin e veprimit!

source: Large UDF volume
sq_al: Volum UDF me permasa te medha

source: This image uses Syslinux %s%s but this application only includes the installation files for Syslinux %s%s. As new versions of Syslinux are not compatible with one another, and it wouldn't be possible for Rufus to include them all, two additional files must be downloaded from the Internet ('ldlinux.sys' and 'ldlinux.bss'): - Select 'Yes' to connect to the Internet and download these files - Select 'No' to cancel the operation Note: The files will be downloaded in the current application directory and will be reused automatically if present.
sq_al: Ky imazh perdor Syslinux %s%s por aplikacioni perfshin file vetem per per Syslinux %s%s. Versionet e reja te Syslinux nuk jane te perdorshem me variantet e mepareshme dhe Rufus nuk mund ti perfshije te tera, duhen shkarkuar dy file shtese ('ldlinux.sys' e 'ldlinux.bss'): - Zgjidh 'Po' qe te lidhesh ne internet dhe te shkarkosh file - Zgjidh 'Jo' nese do ta kopjosh kete file me vone ne njesi Shenim: file do te shkarkohet ne direktorine aktuale te aplikacionit dhe pasi eshte shkarkuar, do te perdoret vetvetiu.

source: Download required
sq_al: Kerkohet shakrim

source: This image uses Grub %s but the application only includes the installation files for Grub %s. As different versions of Grub may not be compatible with one another, and it is not possible to include them all, Rufus will attempt to locate a version of the Grub installation file ('core.img') that matches the one from your image: - Select 'Yes' to connect to the Internet and attempt to download it - Select 'No' to use the default version from Rufus - Select 'Cancel' to abort the operation Note: The file will be downloaded in the current application directory and will be reused automatically if present. If no match can be found online, then the default version will be used.
sq_al: Ky imazh perdor Grub %s por aplikacioni ka vetem filet e instalimit per Grub %s. Ky version Grub mund te jete i paperdorshem, dhe nuk mund te perfshihen te gjitha filet e instalimit. Rufus do kerkoje te gjeje nje instalues te Grub ('core.img') i cili shkon me iamzhin. - Zgjidh 'Po' qe te lidhesh ne internet dhe te shkarkosh file - Zgjidh 'Jo' nese do te perdoresh versionin e paracaktuar nga Rufus - Zgjidh 'Ndalo' per te ndaluar veprimin. Shenim: file do te shkarkohet ne direktorine aktuale te aplikacionit dhe do te riperdoren vetvetiu nese jane te pranishem. Nese nuk do te gjendet ne internet shkarkimi atehere do te perdoret versioni i paracaktuar.

source: Standard Windows installation
sq_al: Instalimi Windows standard

source: advanced drive properties
sq_al: veti te avancuara te drive

source: advanced format options
sq_al: opsione te avancuara formatimi

source: Show %s
sq_al: Trego %s

source: Hide %s
sq_al: Fshih %s

source: Persistent partition size
sq_al: Permasa particioni te qendrueshme

source: No persistence
sq_al: Jo e qendrueshme

source: Set the size of the persistent partition for live USB media. Setting the size to 0 disables the persistent partition.
sq_al: Percakto permasat e qendrueshme te drive USB live. Duke vendosur permasen zero c'aktivizohet particioni i qendrueshem.

source: Set the partition size units.
sq_al: Percakto njesine e permases se particionit.

source: Do not show this message again
sq_al: Mos e shfaq me kete mesazh

source: Important notice about %s
sq_al: Informacion i rendesishem mbi %s

source: You have just created a media that uses the UEFI:NTFS bootloader. Please remember that, to boot this media, YOU MUST DISABLE SECURE BOOT. For details on why this is necessary, see the 'More Information' button below.
sq_al: Sapo krijove nje njesi qe perdor bootloader UEFI:NTFS. Kujtohu qe per te nisur kete njesi duhet PATJETER TE C'AKTIVIZOHET SECURE BOOT. Per sqarime te metejshme zgjidh butonin 'Info te tjera'.

source: Windows image selection
sq_al: Zgjedhje e imazhit Windows

source: This ISO contains multiple Windows images. Please select the image you wish to use for this installation:
sq_al: Ky imazh ISO permban shume imazhe te ndryshme te Windows. Zgjidh cilin imazh do te perdoresh per kete instalim:

source: Another program or process is accessing this drive. Do you want to format it anyway?
sq_al: Nje tjeter program ose proces po perdor kete njesi. Vendos qe ta formatosh pavaresisht perdorimit?

source: Rufus has detected that you are attempting to create a Windows To Go media based on a 1809 ISO. Because of a *MICROSOFT BUG*, this media will crash during Windows boot (Blue Screen Of Death), unless you manually replace the file 'WppRecorder.sys' with a 1803 version. Also note that the reason Rufus cannot automatically fix this for you is that 'WppRecorder.sys' is a Microsoft copyrighted file, so we cannot legally embed a copy of the file in the application...
sq_al: Rufus kuptoi qe po tentot te krijosh nje instalim 'Windows To Go' bazuar mbi nje ISO 1809. Per shkak te nje *BUG MICROSOFT*, ky suport ndalon se fuksionuar gjate boot te Windows (Blue Screen Of Death), pervec rastit kur modifikohet vete file 'WppRecorder.sys' me nje version 1803. Shenim: nder te tjera arsyeja pse Rufus nuk mund te zgjidhe vete kete problem eshte se 'WppRecorder.sys' mbrohet nga nje copyright i Microsoft, do te thote se nuk mund te perfshihet ligjerisht ne aplikacion...

source: Because MBR has been selected for the partition scheme, Rufus can only create a partition up to 2 TB on this media, which will leave %s of disk space unavailable. Are you sure you want to continue?
sq_al: Duke zgjedhur 'MBR' si skeme particionimi, Rufus mund te krijoje mbi kete njesi particione me permasa maksimale 2 TB, kjo do te lere nje hapesire prej %s te paperdoreshme ne disk. Je i sigurt qe do te vazhdosh?

source: Version
sq_al: Versioni

source: Edition
sq_al: Edicioni

source: Language
sq_al: Gjuha

source: Architecture
sq_al: Arkitektura

source: Continue
sq_al: Vazhdo

source: Back
sq_al: Mbrapa

source: Please wait...
sq_al: Prit...

source: Download using a browser
sq_al: Shkarkon nga browser

source: Temporarily banned by Microsoft for requesting too many downloads - Please try again later...
sq_al: Perkohesisht e ndaluar nga Microsoft per shkak te shume shkarkimeve Provo me vone ...

source: PowerShell 3.0 or later is required to run this script.
sq_al: Per te ekzekutuar kete script duhet PowerShell v. 3.0 ose me e re.

source: Do you want to go online and download it?
sq_al: Do te shkosh ne internet per te shkarkuar?

source: Running download script...
sq_al: Ekzekutim i scripteve te shkarkimit...

source: Download ISO Image
sq_al: Shakrko imazhin ISO

source: Type of computer you plan to use this bootable drive with. It is your responsibility to determine whether your target is of BIOS or UEFI type before you start creating the drive, as it may fail to boot otherwise.
sq_al: Lloji i kompjuterit per te cilin do te besh boot. Kjo eshte pergjegjesi personale, para se te krijohet njesia duhet identifikuar nese sistemi eshte tip BIOS ose UEFI. Perndryshe boot nuk do funksionoje.

source: 'UEFI-CSM' means that the device will only boot in BIOS emulation mode (also known as 'Legacy Mode') under UEFI, and not in native UEFI mode.
sq_al: 'UEFI CSM' do te thote qe njesia do te kryeje boot vetem ne emulim BIOS(i njohur si 'Legacy Mode') ne UEFI, dhe jo direkt ne UEFI.

source: 'non CSM' means that the device will only boot in native UEFI mode, and not in BIOS emulation mode (also known as 'Legacy Mode').
sq_al: 'non CSM' do te thote qe njesia do te kryeje boot direkt en UEFI, dhe jo ne emulim BIOS(i njohur si 'Legacy Mode')

source: Test pattern: 0x%02X
sq_al: Pattern test: 0x%02X

source: Test pattern: 0x%02X, 0x%02X
sq_al: Pattern test: 0x%02X, 0x%02X

source: Test pattern: 0x%02X, 0x%02X, 0x%02X
sq_al: Pattern test: 0x%02X, 0x%02X, 0x%02X

source: Test pattern: 0x%02X, 0x%02X, 0x%02X, 0x%02X
sq_al: Pattern test: 0x%02X, 0x%02X, 0x%02X, 0x%02X

source: Sets the target filesystem
sq_al: Vendosni file-system te destinacionit

source: Minimum size that a block of data will occupy in the filesystem
sq_al: Permasat me te vogla te bllokut te file-system

source: Use this field to set the drive label. International characters are accepted.
sq_al: Perdor kete fushe per te vendosur etiketen e njesise. Karakteret nderkombetare jane te pranuara.

source: Toggle advanced options
sq_al: Aktivizo/c'aktivizo opsionet e avancuara

source: Check the device for bad blocks using a test pattern
sq_al: Kontrollo njesine per blloqe te demtuara me test pattern.

source: Uncheck this box to use the "slow" format method
sq_al: Mos e zgjidh kete opsion nese do te formatosh ne menyre te plote dhe te "ngadalte".

source: Method that will be used to create partitions
sq_al: Metoda qe do te perdoret per te krijuar particionet
